>Необходимо:
>
>- реализовать иерархию классов, описывающих геометрические фигуры (прямоугольник, окружность, треугольник, квадрат). Каждую фигуру можно подвинуть, отмасштабирвать, повернуть. Каждая фигура задается своими геометрическими параметрами, цветом, названием.
>
>- реализовать класс, который позволяет добавлять, удалять, выводить информацию о всех геометрических фигурах (для каждой фигуры - все ее параметры) в нем содержащихся; также этот класс должен позволять двигать, масштабирать, поворачивать все фигуры/фигуры заданного типа/конкретную фигуру по ее имени;
>
>- реализация этого класса должна быть основана на одно(двух)-связном списке (запрещается использовать STL/boost и пр.);
